'''
Chapter : 5 - item : 5 - แม่งูเอ๋ย กินน้ำบ่อไหน?

เเม่งูเอ๋ยกินน้ำบ่อไหน กินน้ำบ่อทราย ย้ายไปก็ย้ายมา~

แม่งูต้องการสอนลูกงูเล่นให้รู้จักกับ linked-list โดยทำการนัดกับพ่องูให้เล่นเกมงูกินหางด้วยกัน โดยแม่งูจะเรียกลูกงูให้มาเกาะแม่งูกันเป็นเส้นตรง และให้งูทุกตัวแสดงน้ำหนักตัวเอง (แม่งูจะอยู่หัวเสมอ) ต่อมาแม่งูได้สอนการละเล่นงูกินหาง ให้ลูกงูดังนี้

ถ้าพ่องูร้องว่า “กินน้ำบ่อไหน” และถ้าแม่งูตอบว่า

    “กินน้ำบ่อทราย ย้ายไปก็ย้ายมา”

เมื่อลูกงูได้ยินคำสั่ง “ย้ายไปก็ย้ายมา” ให้ลูกงูที่เกาะเเม่งูอยู่นั้นสลับตำแหน่งเลขคู่เลขคี่กัน (1->2, 2->1) (ระวังลูกงูสับสน)

    “กินน้ำบ่อโศก โยกไปก็โยกมา”

เมื่อลูกงูได้ยินคำสั่ง “โยกไปก็โยกมา”  ให้ลูกงูโยก แต่เผอิญว่าแม่งูก็โยกเช่นกัน และโยกแรงเกิน ทำให้ลูกงูที่มีขนาดเล็กกว่าแม่งูนั้นหลุดออกจากวงไป โดยลูกงูที่หลุดออกจากขบวน จะมานั่งดูแม่งูและลูกคนอื่นๆเล่นเกมต่อไป (แสดงตัวเลขที่หลุดออกจาก  linked-list)

    “กินน้ำบ่อหิน บินไปก็บินมา”

“บินไปก็บินมา” เป็นคำสั่งที่ให้แม่งูติดปีกบินไปขโขยลูกงูชาวบ้านมา โดยลูกงูที่แม่งูขโมยมาให้ไปต่อท้ายลูกงูตัวสุดท้ายในขบวนตลอด (แสดงตัวเลขที่แม่งูไปขโมยมาด้วย)

    “กินหัวกินหาง กินกลางตลอดตัว”

“กินกลางตลอดตัว” เป็นคำสั่งที่ให้แม่งูและลูกงูเตรียมพร้อมรับแรงกระแทกจากพ่องู

    โดยหากน้ำหนักของแม่งูและลูกงูรวมกันน้อยกว่าพ่องู แม่งูต้องเสียลูกงูจนกว่า พ่องูจะเจอลูกงูที่มีขนาดที่หารขนาดพ่องูลงตัว (ขนาดพ่องู mod ขนาดลูกงู = 0)

    แต่หากไม่มีลูกงูตัวไหนที่หารน้ำหนักพ่องูได้เลย แม่งูจึงตัดสินใจสลับหัว-หางกับลูกตัวเอง

(0 เป็นลูกรัก แม่งูจะไม่ให้ตัวนี้ไปหารกับพ่องูเด็ดขาด)

	โดยลูกงูที่หลุดออกจากขบวน จะมานั่งดูแม่งูและลูกคนอื่นๆเล่นเกมต่อไป (แสดงตัวเลขที่หลุดออกจาก  linked-list)

แม่งูจะตายหากไม่มีลูกงูเกาะแม่งูอยู่เลย แม้ว่าคำสั่งต่อมาจะบอกให้แม่งูบินไปขโมยลูกงูมาก็ตาม

คำสั่ง:

- บันทัดแรกแรกจะเป็นการรับตัวเลขเพื่อสร้างครอบครัวงู และรับคำสั่ง

เช่น 	Snake family : 10 9 8 7 (แม่งูคือ 10, และมีลูกงูได้แก่ 9 8 7)

	(10)->9->8->7

- บรรทัดต่อมาจะเป็นการรับคำสั่ง โดย

“ย้ายไปก็ย้ายมา” : SW

“โยกไปก็โยกมา” : SH

“บินไปก็บินมา” : F <input>

“กินกลางตลอดตัว” : D <input>

เช่น 	Snake Game : 10 9 8 7/D 7,SH,SW,F 8

	(10)->9->8->7 (แม่งูคือ 10, และมีลูกงูได้แก่ 9 8 7)

จะเป็นการเล่นกับพ่องูที่มีขนาดเท่ากับ 7, แม่งูโยก, ลูกสลับตำแหน่ง, แม่งูขโมยลูกงูที่มีขนาด 8 ตามลำดับ

Snake Game : 10 9 8 7/D 7,SH,SW,F 8
(10)->9->8->7
Play success!->[]
(10)->9->8->7
------------------------------
Shake success!->[]
(10)->9->8->7
------------------------------
Swap success!
(10)->8->9
------------------------------
Steal success!->8
(10)->8->9->8
------------------------------
Snake Game :

Snake Game : 5 1 2 3 4 5 6 7 8 9 10/SW,SH,F 4,D 63
(5)->1->2->3->4->5->6->7->8->9->10
Swap success!
(5)->2->1->4->3->6->5->8->7->10->9
------------------------------
Shake success!->[6, 8, 7, 10, 9]
(5)->2->1->4->3->5
------------------------------
Steal success!->4
(5)->2->1->4->3->5->4
------------------------------
Play success!->[5, 4]
(5)->2->1->4->3
------------------------------
Snake Game :

Snake Game : 10 5 7 3/SH,SH,SW,SW,D 44
(10)->5->7->3
Shake success!->[]
(10)->5->7->3
------------------------------
Shake success!->[]
(10)->5->7->3
------------------------------
Swap success!
(10)->7->5
------------------------------
Swap success!
(10)->5->7
------------------------------
Play success!->[]
(7)->5->10
------------------------------
Snake Game :

Snake Game : 1 2 3/SH,D 99,SW
(1)->2->3
Shake success!->[2, 3]
(1)->Empty
------------------------------
Mom is dead
Snake Game :

Snake Game : 4 0 0/F 8,F 7,F 6,D 71,D 122,D 77,D 88,SW,D 31
(4)->0->0
Steal success!->8
(4)->0->0->8
------------------------------
Steal success!->7
(4)->0->0->8->7
------------------------------
Steal success!->6
(4)->0->0->8->7->6
------------------------------
Play success!->[]
(6)->0->0->8->7->4
------------------------------
Play success!->[]
(4)->0->0->8->7->6
------------------------------
Play success!->[6]
(4)->0->0->8->7
------------------------------
Play success!->[7]
(4)->0->0->8
------------------------------
Swap success!
(4)->0->0
------------------------------
Play success!->[]
(0)->0->4
------------------------------
Snake Game :

Snake Game : -4 -3 -2 -1 0/SW,F 0,F 0,F 0,D 0,D 0,SW,SH
(-4)->-3->-2->-1->0
Swap success!
(-4)->-2->-3->0->-1
------------------------------
Steal success!->0
(-4)->-2->-3->0->-1->0
------------------------------
Steal success!->0
(-4)->-2->-3->0->-1->0->0
------------------------------
Steal success!->0
(-4)->-2->-3->0->-1->0->0->0
------------------------------
Play success!->[0, 0, 0]
(-4)->-2->-3->0->-1
------------------------------
Play success!->[]
(-4)->-2->-3->0->-1
------------------------------
Swap success!
(-4)->-3->-2->-1->0
------------------------------
Shake success!->[-3, -2, -1, 0]
(-4)->Empty
------------------------------
Mom is dead
Snake Game :

Snake Game : 7 8 9/F 10,SW,SW,SH
(7)->8->9
Steal success!->10
(7)->8->9->10
------------------------------
Swap success!
(7)->9->8
------------------------------
Swap success!
(7)->8->9
------------------------------
Shake success!->[8, 9]
(7)->Empty
------------------------------
Mom is dead
Snake Game :

Snake Game : 9 9 9 9 9/SH,F -100,D 101,D -40,F -100,SW,SH,D -20,SH,SW
(9)->9->9->9->9
Shake success!->[]
(9)->9->9->9->9
------------------------------
Steal success!->-100
(9)->9->9->9->9->-100
------------------------------
Play success!->[]
(-100)->9->9->9->9->9
------------------------------
Play success!->[]
(9)->9->9->9->9->-100
------------------------------
Steal success!->-100
(9)->9->9->9->9->-100->-100
------------------------------
Swap success!
(9)->9->9->9->9->-100->-100
------------------------------
Shake success!->[]
(9)->9->9->9->9->-100->-100
------------------------------
Play success!->[]
(-100)->9->9->9->9->-100->9
------------------------------
Shake success!->[9, 9, 9, 9, 9]
(-100)->-100
------------------------------
Swap success!
(-100)->Empty
------------------------------
Mom is dead
Snake Game :
'''